CSI API ETABS v1

# cComboGetTypeOAPI Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetTypeOAPI(
    	string name,
    	ref int ComboType
    )

    Function GetTypeOAPI (
    	name As String,
    	ByRef ComboType As Integer
    ) As Integer

    Dim instance As cCombo
    Dim name As String
    Dim ComboType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetTypeOAPI(name,
    	ComboType)

    int GetTypeOAPI(
    	String^ name,
    	int% ComboType
    )

    abstract GetTypeOAPI :
            name : string *
            ComboType : int byref -> int

#### Parameters

name

    Type: SystemString

ComboType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cCombo Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com